x = 1234.56789
# 小数点后保留两位数，输出结果：'1234.57'
print(format(x, '0.2f'))      
# 数字在12个字符长度的区域内右对齐，并保留小数点后1位数字，输出结果：'      1234.6'      
print(format(x, '>12.1f'))          
# 数字在12个字符长度的区域内左对齐，并保留小数点后3位数字，紧接着输出20，输出结果：'1234.568     20'
print(format(x, '<12.3f'), 20)
# 数字在12个字符长度的区域内右对齐，并保留小数点后1位数字，数字前面补0，输出结果：'0000001234.6'
print(format(x, '0>12.1f'))
# 数字在12个字符长度的区域内左对齐，并保留小数点后1位数字，数字后面补0，输出结果：'1234.6000000'
print(format(x, '0<12.1f'))
# 数字在12个字符长度的区域内中心对齐，并保留小数点后2位数字，紧接着输出3，输出结果：'   1234.57   3'
print(format(x, '^12.2f'),3)
# 每千位用逗号（,）分隔，输出结果：1,234.56789
print(format(x, ','))
# 每千位用逗号（,）分隔，并保留小数点后2位数字，输出结果：1,234.57
print(format(x, ',.2f'))
# 用科学计数法形式输出数字，输出结果：1.234568e+03
print(format(x, 'e'))
# 用科学计数法形式输出数字，尾数保留小数点后2位数字，输出结果：1.23E+03
print(format(x, '0.2E'))
